In [1]:
import pandas as pd
pd.set_option("future.no_silent_downcasting", True)

from wsi.indicators.education import build_education_df
from wsi.indicators.employment import build_employment_df
from wsi.indicators.parliament import build_parliamentary_df
from wsi.indicators.poverty import build_poverty_df
from wsi.indicators.legal import build_legal_df
from wsi.indicators.son_bias import build_son_bias_df
from wsi.indicators.maternal_mortality import build_maternal_mortality_df

In [10]:
build_maternal_mortality_df()

     ISO_code  Year  Maternal Mortality
0         AFG  2000          1346.14410
1         AFG  2001          1273.43134
2         AFG  2002          1277.30797
3         AFG  2003          1196.09069
4         AFG  2004          1114.88723
...       ...   ...                 ...
3880      ZMB  2016           155.35731
3881      ZMB  2017           155.82331
3882      ZMB  2018           144.87115
3883      ZMB  2019           128.84006
3884      ZMB  2020           134.66542

[3885 rows x 3 columns]

In [2]:
a = build_son_bias_df()

a['Year'].max()

np.int64(2025)

In [3]:
df= build_legal_df()
df

      ISO_code  Year  Legal Protection Index
0          AFG  1971                0.197917
1          AFG  1972                0.197917
2          AFG  1973                0.197917
3          AFG  1974                0.197917
4          AFG  1975                0.197917
...        ...   ...                     ...
10255      ZWE  2020                0.875000
10256      ZWE  2021                0.875000
10257      ZWE  2022                0.875000
10258      ZWE  2023                0.875000
10259      ZWE  2024                0.875000

[10260 rows x 3 columns]

In [4]:
build_poverty_df()

     ISO_code  Year  Poverty
0         ALB  2002      1.1
1         ALB  2005      0.6
2         ALB  2008      0.2
3         ALB  2012      0.6
4         ALB  2014      1.0
...       ...   ...      ...
1606      ZMB  2004     61.1
1607      ZMB  2006     64.7
1608      ZMB  2010     64.4
1609      ZMB  2015     60.8
1610      ZMB  2022     64.3

[1611 rows x 3 columns]

In [5]:
build_parliamentary_df()

     ISO_code  Year  Parliamentary Representation
0         SWE  1997                     40.401146
1         NOR  1997                     39.393939
2         FIN  1997                     33.500000
3         DNK  1997                     32.960894
4         NLD  1997                     31.333333
...       ...   ...                           ...
5424      BGD  2025                      0.000000
5425      KWT  2025                      0.000000
5426      MMR  2025                      0.000000
5427      NER  2025                      0.000000
5428      SDN  2025                      0.000000

[5429 rows x 3 columns]

In [6]:
edu_world = build_education_df()
edu_world['Year'].max()

np.int64(2023)

In [7]:
emp_world = build_employment_df()
emp_world

     ISO_code  Year  Employment
0         ABW  2011   69.688359
1         AFG  2008   48.240352
2         AFG  2012   16.858257
3         AFG  2014   22.798185
4         AFG  2017   20.883585
...       ...   ...         ...
2885      ZWE  2014   82.014813
2886      ZWE  2019   68.255373
2887      ZWE  2021   64.499665
2888      ZWE  2022   63.862897
2889      ZWE  2023   65.737269

[2890 rows x 3 columns]

In [8]:
emp_world['Year'].max()

np.int64(2024)